###############################################################################
# Created by write_sdc
###############################################################################
current_design credit_t_switch_wrap
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 806.7117 [get_ports {clk}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_credit_gnt[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_credit_gnt[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_target[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_target[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_credit_gnt[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_credit_gnt[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_target[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_target[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_credit_gnt[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_credit_gnt[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_target[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_target[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_packet[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_credit_gnt[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_credit_gnt[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_target[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_credit_vc_target[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_packet[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_credit_gnt[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_credit_gnt[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_target[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_credit_vc_target[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_packet[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_credit_gnt[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_credit_gnt[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_target[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_credit_vc_target[1]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
