###############################################################################
# Created by write_sdc
###############################################################################
current_design credit_pi_switch
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1000.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[37]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[38]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[39]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[40]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[41]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[42]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[43]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[44]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[45]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[46]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[47]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[48]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[49]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[50]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[51]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[52]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[53]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[54]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[55]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[56]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[57]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[58]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[59]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[60]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[61]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[62]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[63]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[64]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[65]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[66]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[67]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[68]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[69]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[70]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[71]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[72]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[73]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i_v[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i_v[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o_credit_gnt[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o_credit_gnt[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[37]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[38]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[39]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[40]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[41]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[42]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[43]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[44]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[45]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[46]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[47]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[48]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[49]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[50]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[51]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[52]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[53]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[54]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[55]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[56]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[57]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[58]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[59]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[60]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[61]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[62]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[63]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[64]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[65]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[66]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[67]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[68]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[69]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[70]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[71]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[72]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[73]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i_v[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i_v[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o_credit_gnt[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o_credit_gnt[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[37]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[38]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[39]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[40]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[41]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[42]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[43]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[44]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[45]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[46]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[47]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[48]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[49]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[50]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[51]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[52]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[53]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[54]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[55]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[56]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[57]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[58]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[59]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[60]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[61]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[62]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[63]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[64]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[65]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[66]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[67]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[68]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[69]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[70]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[71]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[72]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[73]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i_v[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i_v[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o_credit_gnt[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o_credit_gnt[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[37]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[38]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[39]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[40]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[41]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[42]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[43]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[44]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[45]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[46]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[47]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[48]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[49]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[50]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[51]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[52]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[53]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[54]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[55]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[56]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[57]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[58]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[59]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[60]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[61]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[62]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[63]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[64]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[65]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[66]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[67]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[68]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[69]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[70]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[71]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[72]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[73]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i_v[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i_v[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o_credit_gnt[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o_credit_gnt[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i_bp[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i_bp[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o_v[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o_v[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i_bp[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i_bp[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o_v[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o_v[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i_bp[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i_bp[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o_v[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o_v[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i_bp[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_i_bp[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o_v[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u1_o_v[1]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
