###############################################################################
# Created by write_sdc
###############################################################################
current_design t_switch
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1000.0000 [get_ports {clk}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ce}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_i[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_i[9]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[0]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[10]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[11]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[12]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[13]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[14]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[15]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[16]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[17]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[18]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[19]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[1]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[20]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[21]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[22]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[23]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[24]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[25]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[26]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[27]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[28]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[29]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[2]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[30]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[31]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[32]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[33]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[34]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[35]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[36]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[3]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[4]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[5]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[6]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[7]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[8]}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_i[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {done}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {l_o[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {r_o[9]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[0]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[10]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[11]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[12]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[13]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[14]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[15]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[16]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[17]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[18]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[19]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[1]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[20]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[21]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[22]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[23]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[24]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[25]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[26]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[27]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[28]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[29]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[2]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[30]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[31]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[32]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[33]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[34]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[35]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[36]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[3]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[4]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[5]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[6]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[7]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[8]}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {u0_o[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
